DataProcessors/КассовыеОперации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<DataProcessor>
		<Properties>
			<Name>КассовыеОперации</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПоступлениеВКассу</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответсвенный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приложение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринятоОт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасшифровкаПлатежа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МесяцНачисления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПризнакАванса</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Касса</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ДатыЗапретаИзменения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ДатыЗапретаИзменения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаЗапрета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОписаниеДатыЗапрета</Name>
					<Comment>Описание относительной даты запрета, используемое для вычисления даты запрета на текущую дату</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий к отдельной настройке запрета по пользователю/группу пользователей</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Раздел</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.РазделыДатЗапретаИзменения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыВнешнихПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыНазначенияДатЗапрета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НазначенныеУслуги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>НазначенныеУслуги</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПлатежиПоРеструктуризацииДолга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ПлатежиПоРеструктуризацииДолга</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаПлатежа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбщаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыОперацийПоступлениеВКассу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПоступлениеВКассу</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОтЛицевогоСчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратДС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПланированиеАвансов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ПланированиеАвансов</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисленияБазыРаспределения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЛицевыеСчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоБазыРаспределения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНачислено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаАванса</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>БазаРаспределения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УслугаБазыРаспределения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/КассовыеОперации/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура Заполнить(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.ЛицевойСчет) Тогда
		Предупреждение(НСтр("ru = 'Не выбран лицевой счет'; uk = 'Не вибраний особовий рахунок'"));
		Возврат;
	КонецЕсли;
	
	Если Объект.СуммаДокумента = 0 Тогда
		Предупреждение(НСтр("ru='Укажите вначале сумму документа.';uk='Укажіть спочатку суму документа.'"));
		Возврат;
	КонецЕсли;
	
	Если Объект.РасшифровкаПлатежа.Количество() > 0 Тогда
	
		Ответ = Вопрос(
			НСтр("ru='Расшифровка будет полностью перезаполнена. Продолжить?';uk='Розшифрування буде повністю перезаповнене. Продовжити?'"),
			РежимДиалогаВопрос.ДаНет
		);
			
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Объект.РасшифровкаПлатежа.Очистить();
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеВКассу.ОтЛицевогоСчета") Тогда
		
		ЗаполнитьРасшифровкуПлатежа();
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРасшифровкуПлатежа(ТекущийОбъект = Неопределено)
	Если ТекущийОбъект = Неопределено Тогда
		ТекущийОбъект = Объект;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДатыЗапретаИзменения.ДатаЗапрета
	|ИЗ
	|	РегистрСведений.ДатыЗапретаИзменения КАК ДатыЗапретаИзменения
	|ГДЕ
	|	ДатыЗапретаИзменения.Раздел = ЗНАЧЕНИЕ(ПланВидовХарактеристик.РазделыДатЗапретаИзменения.Здания)
	|	И ДатыЗапретаИзменения.Объект = &Здание";
	
	Запрос.УстановитьПараметр("Здание", ТекущийОбъект.ЛицевойСчет.Владелец);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Период = Выборка.ДатаЗапрета;
	Иначе
		Период = ТекущийОбъект.Дата;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ НазначенныеУслугиСрезПоследних.Услуга.Организация = ЗНАЧЕНИЕ(Справочник.Организации.Пустаяссылка)
	|			ТОГДА НазначенныеУслугиСрезПоследних.Услуга.Организация
	|		ИНАЧЕ НазначенныеУслугиСрезПоследних.ЛицевойСчет.Владелец.Организация
	|	КОНЕЦ КАК Организация
	|ПОМЕСТИТЬ Организации
	|ИЗ
	|	РегистрСведений.НазначенныеУслуги.СрезПоследних(
	|			,
	|			ЛицевойСчет = &ЛицевойСчет
	|				И Действует = ИСТИНА) КАК НазначенныеУслугиСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасчетыПоЛицевымСчетамОстатки.Услуга,
	|	РасчетыПоЛицевымСчетамОстатки.МесяцНачисления КАК МесяцНачисления,
	|	РасчетыПоЛицевымСчетамОстатки.Организация,
	|	СУММА(РасчетыПоЛицевымСчетамОстатки.СуммаОстаток) КАК Сумма,
	|	РасчетыПоЛицевымСчетамОстатки.ПризнакАванса
	|ПОМЕСТИТЬ ВТ_расчет
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыПоЛицевымСчетамОстатки.Услуга КАК Услуга,
	|		РасчетыПоЛицевымСчетамОстатки.МесяцНачисления КАК МесяцНачисления,
	|		ЕСТЬNULL(РасчетыПоЛицевымСчетамОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
	|		ВЫБОР
	|			КОГДА НЕ РасчетыПоЛицевымСчетамОстатки.Услуга.Организация = ЗНАЧЕНИЕ(Справочник.Организации.Пустаяссылка)
	|				ТОГДА РасчетыПоЛицевымСчетамОстатки.Услуга.Организация
	|			ИНАЧЕ РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет.Владелец.Организация
	|		КОНЕЦ КАК Организация,
	|		ЛОЖЬ КАК ПризнакАванса
	|	ИЗ
	|		РегистрНакопления.РасчетыПоЛицевымСчетам.Остатки(
	|				,
	|				ЛицевойСчет = &ЛицевойСчет
	|					И МесяцНачисления < &Период
	|					И МесяцНачисления > &ПустаяДата
	|					И Организация В
	|						(ВЫБРАТЬ
	|							Организации.Организация
	|						ИЗ
	|							Организации КАК Организации)) КАК РасчетыПоЛицевымСчетамОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыПоЛицевымСчетамОстаткиАвансы.Услуга,
	|		РасчетыПоЛицевымСчетамОстаткиАвансы.МесяцНачисления,
	|		РасчетыПоЛицевымСчетамОстаткиАвансы.СуммаОстаток,
	|		ВЫБОР
	|			КОГДА НЕ РасчетыПоЛицевымСчетамОстаткиАвансы.Услуга.Организация = ЗНАЧЕНИЕ(Справочник.Организации.Пустаяссылка)
	|				ТОГДА РасчетыПоЛицевымСчетамОстаткиАвансы.Услуга.Организация
	|			ИНАЧЕ РасчетыПоЛицевымСчетамОстаткиАвансы.ЛицевойСчет.Владелец.Организация
	|		КОНЕЦ,
	|		ИСТИНА
	|	ИЗ
	|		РегистрНакопления.РасчетыПоЛицевымСчетам.Остатки(
	|				,
	|				ЛицевойСчет = &ЛицевойСчет
	|					И МесяцНачисления = &ПустаяДата
	|					И Организация В
	|						(ВЫБРАТЬ
	|							Организации.Организация
	|						ИЗ
	|							Организации КАК Организации)) КАК РасчетыПоЛицевымСчетамОстаткиАвансы
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПланированиеАвансовЛицевыеСчета.Ссылка.Услуга,
	|		&ПустаяДата,
	|		ПланированиеАвансовЛицевыеСчета.СуммаНачислено,
	|		ПланированиеАвансовЛицевыеСчета.Ссылка.Организация,
	|		ИСТИНА
	|	ИЗ
	|		Документ.ПланированиеАвансов.ЛицевыеСчета КАК ПланированиеАвансовЛицевыеСчета
	|	ГДЕ
	|		ПланированиеАвансовЛицевыеСчета.Ссылка.Организация В
	|				(ВЫБРАТЬ
	|					Организации.Организация
	|				ИЗ
	|					Организации КАК Организации)
	|		И ПланированиеАвансовЛицевыеСчета.ЛицевойСчет = &ЛицевойСчет
	|		И ПланированиеАвансовЛицевыеСчета.Ссылка.Дата >= &ДатаНач
	|		И ПланированиеАвансовЛицевыеСчета.Ссылка.Дата <= &ДатаКон
	|		И НЕ ПланированиеАвансовЛицевыеСчета.Ссылка.ПометкаУдаления) КАК РасчетыПоЛицевымСчетамОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыПоЛицевымСчетамОстатки.Организация,
	|	РасчетыПоЛицевымСчетамОстатки.Услуга,
	|	РасчетыПоЛицевымСчетамОстатки.МесяцНачисления,
	|	РасчетыПоЛицевымСчетамОстатки.ПризнакАванса
	|
	|ИМЕЮЩИЕ
	|	СУММА(РасчетыПоЛицевымСчетамОстатки.СуммаОстаток) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Кассы.Ссылка КАК Касса,
	|	Кассы.Организация
	|ПОМЕСТИТЬ Касссы
	|ИЗ
	|	Справочник.Кассы КАК Кассы
	|ГДЕ
	|	Кассы.Ответственный = &Ответственный
	|	И Кассы.ПометкаУдаления = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_расчет.Услуга,
	|	ВТ_расчет.МесяцНачисления,
	|	ВТ_расчет.Организация,
	|	ВТ_расчет.Сумма,
	|	ВТ_расчет.ПризнакАванса,
	|	ЕСТЬNULL(Касссы.Касса, """") КАК Касса
	|ИЗ
	|	ВТ_расчет КАК ВТ_расчет
	|		ЛЕВОЕ СОЕДИНЕНИЕ Касссы КАК Касссы
	|		ПО ВТ_расчет.Организация = Касссы.Организация";
	
	//Запрос.УстановитьПараметр("Организация", ТекущийОбъект.Организация);
	Запрос.УстановитьПараметр("ЛицевойСчет", ТекущийОбъект.ЛицевойСчет);
	Запрос.УстановитьПараметр("Период", Период);
	//Запрос.УстановитьПараметр("Ссылка", ТекущийОбъект.Ссылка);
	Запрос.УстановитьПараметр("ПустаяДата", '00010101');
	Запрос.УстановитьПараметр("Ответственный",Объект.Ответсвенный);
	Запрос.УстановитьПараметр("ДатаНач", НачалоМесяца(ТекущийОбъект.Дата));
	Запрос.УстановитьПараметр("ДатаКон", КонецМесяца(ТекущийОбъект.Дата));
	
	ВыборкаРезультатаЗапроса = Запрос.Выполнить().Выбрать();
	
	ТекущийОбъект.РасшифровкаПлатежа.Очистить();
	
	СуммаОсталосьРаспределить = ТекущийОбъект.СуммаДокумента;
	
	//ЗапросПоРеструктуризации
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЕСТЬNULL(ПлатежиПоРеструктуризацииДолга.СуммаПлатежа, 0) КАК Сумма,
	|	ЕСТЬNULL(РасчетыПоЛицевымСчетамОбороты.СуммаРасход, 0) КАК ОплченоВЭтомМесяце
	|ИЗ
	|	РегистрСведений.ПлатежиПоРеструктуризацииДолга КАК ПлатежиПоРеструктуризацииДолга
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоЛицевымСчетам.Обороты(&ДатаНач, &ДатаКон, , Услуга = ЗНАЧЕНИЕ(Справочник.Услуги.РеструктуризацияДолга)) КАК РасчетыПоЛицевымСчетамОбороты
	|		ПО ПлатежиПоРеструктуризацииДолга.ЛицевойСчет = РасчетыПоЛицевымСчетамОбороты.ЛицевойСчет
	|ГДЕ
	|	ПлатежиПоРеструктуризацииДолга.ЛицевойСчет = &ЛицевойСчет
	|	И ПлатежиПоРеструктуризацииДолга.Период = КОНЕЦПЕРИОДА(&Период, МЕСЯЦ)";
	Запрос.УстановитьПараметр("ЛицевойСчет", ТекущийОбъект.ЛицевойСчет);
	Запрос.УстановитьПараметр("Период",Период);
	Запрос.УстановитьПараметр("ДатаНач", НачалоМесяца(ТекущийОбъект.Дата));
	Запрос.УстановитьПараметр("ДатаКон", КонецМесяца(ТекущийОбъект.Дата));
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Если Выборка.ОплченоВЭтомМесяце <> 0 Тогда
			Сумма = Выборка.Сумма - Выборка.ОплченоВЭтомМесяце;
			Если Сумма < 0 Тогда
				Сумма = 0;
			КонецЕсли;
		Иначе	 
			Сумма = Выборка.Сумма;
		КонецЕсли;
		
	Иначе 
		Сумма = 0;
	КонецЕсли;
	
	Пока СуммаОсталосьРаспределить > 0 Цикл
		
		НоваяСтрока = ТекущийОбъект.РасшифровкаПлатежа.Добавить();
		
		Если ВыборкаРезультатаЗапроса.Следующий() Тогда
			Если ВыборкаРезультатаЗапроса.Услуга = Справочники.Услуги.РеструктуризацияДолга  Тогда  //Сначала оплатим по реструктуризации
				Если Сумма <> 0 Тогда
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаРезультатаЗапроса);
					
					Если Сумма <= СуммаОсталосьРаспределить Тогда // сумма остатка меньше или равна чем осталось распределить
						
						НоваяСтрока.Сумма = Сумма;
						СуммаОсталосьРаспределить = СуммаОсталосьРаспределить - Сумма;
						
					Иначе // сумма остатка больше чем нужно распределить
						
						НоваяСтрока.Сумма =	СуммаОсталосьРаспределить;
						СуммаОсталосьРаспределить = 0;
						
					КонецЕсли;
				Иначе 
					ТекущийОбъект.РасшифровкаПлатежа.Удалить(НоваяСтрока.НомерСтроки-1);	
				КонецЕсли;
			Иначе
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаРезультатаЗапроса);
				
				Если ВыборкаРезультатаЗапроса.Сумма <= СуммаОсталосьРаспределить Тогда // сумма остатка меньше или равна чем осталось распределить
					
					НоваяСтрока.Сумма = ВыборкаРезультатаЗапроса.Сумма;
					СуммаОсталосьРаспределить = СуммаОсталосьРаспределить - ВыборкаРезультатаЗапроса.Сумма;
					
				Иначе // сумма остатка больше чем нужно распределить
					
					НоваяСтрока.Сумма =	СуммаОсталосьРаспределить;
					СуммаОсталосьРаспределить = 0;
					
				КонецЕсли;
			КонецЕсли;
			
		Иначе
			
			НоваяСтрока.Сумма = СуммаОсталосьРаспределить;
			НоваяСтрока.Организация = Объект.ЛицевойСчет.Владелец.Организация;
			НоваяСтрока.ПризнакАванса = Истина;
			СуммаОсталосьРаспределить = 0;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ТекущийОбъект.РасшифровкаПлатежа.Количество() = 0 Тогда
		ТекущийОбъект.РасшифровкаПлатежа.Добавить();
		ТекущийОбъект.РасшифровкаПлатежа[0].Сумма = Объект.СуммаДокумента;
		ТекущийОбъект.РасшифровкаПлатежа[0].ПризнакАванса = Истина;
		
	КонецЕсли;
	
	ТабОрганизации = ТекущийОбъект.РасшифровкаПлатежа.Выгрузить(,"Организация");
	ТабОрганизации.Свернуть("Организация");
	Для каждого Строка из  ТабОрганизации Цикл
		НоваяСтрока = Организации.Добавить(Строка.Организация);
	КонецЦикла;	
		
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.Ответсвенный = Пользователи.АвторизованныйПользователь();
	Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеВКассу.ОтЛицевогоСчета;
	Объект.Дата = ТекущаяДата();
	ВалютаДенежныхСредств = Константы.ВалютаУчета.Получить();
	
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументыНаСервере()
	
	ТабоицаДляДокументов = Новый ТаблицаЗначений;
	ТабоицаДляДокументов.Колонки.Добавить("Организация",Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТабоицаДляДокументов.Колонки.Добавить("Касса",Новый ОписаниеТипов("СправочникСсылка.Кассы"));
	ТабоицаДляДокументов.Колонки.Добавить("Услуга",Новый ОписаниеТипов("СправочникСсылка.Услуги"));
    ТабоицаДляДокументов.Колонки.Добавить("МесяцНачисления",Новый ОписаниеТипов("Дата"));
	ТабоицаДляДокументов.Колонки.Добавить("ПризнакАванса",Новый ОписаниеТипов("Булево"));
	ТабоицаДляДокументов.Колонки.Добавить("Сумма",Новый ОписаниеТипов("Число"));

	
	ТабоицаДляДокументов = Объект.РасшифровкаПлатежа.Выгрузить();
	
	ТабоицаДляДокументов.Сортировать("Организация,МесяцНачисления");
	
	
	Запрос = НОвый Запрос;
	ЗАпрос.УстановитьПараметр("ТаблицаОбработки",ТабоицаДляДокументов);
	ЗАпрос.УстановитьПараметр("Ответственный",Объект.Ответсвенный);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаОбработки.Организация КАК Организация,
	               |	ТаблицаОбработки.Услуга,
	               |	ТаблицаОбработки.МесяцНачисления,
	               |	ТаблицаОбработки.Сумма КАК Сумма,
	               |	ТаблицаОбработки.ПризнакАванса,
	               |	&Ответственный,
	               |	ТаблицаОбработки.Касса
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	&ТаблицаОбработки КАК ТаблицаОбработки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ.Организация КАК Организация,
	               |	ВТ.Услуга,
	               |	ВТ.МесяцНачисления,
	               |	ВТ.Сумма КАК Сумма,
	               |	ВТ.ПризнакАванса,
	               |	ВТ.Касса КАК Касса
	               |ИЗ
	               |	ВТ КАК ВТ
	               |ИТОГИ
	               |	СУММА(Сумма),
	               |	МАКСИМУМ(Касса)
	               |ПО
	               |	Организация" ;
	Запрос.УстановитьПараметр("Ответственный",Объект.Ответсвенный);
	Результат = Запрос.Выполнить();	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаОрганизация = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаОрганизация.Следующий() Цикл
		ДокументПоступление =  Документы.ПоступлениеВКассу.СоздатьДокумент();
		ДокументПоступление.Организация = ВыборкаОрганизация.Организация;
		ДокументПоступление.Касса = ВыборкаОрганизация.Касса;
		ДокументПоступление.СуммаДокумента = ВыборкаОрганизация.Сумма;
		ДокументПоступление.ВидОперации = Перечисления.ВидыОперацийПоступлениеВКассу.ОтЛицевогоСчета;
		ДокументПоступление.Дата = Объект.Дата;
		ДокументПоступление.ЛицевойСчет = Объект.ЛицевойСчет;
		ДокументПоступление.Комментарий = Объект.Комментарий;
		ДокументПоступление.РасшифровкаПлатежаСписком = Истина;
		ВыборкаДетали = ВыборкаОрганизация.Выбрать();
		Пока ВыборкаДетали.Следующий() Цикл
			НоваяСтрока= ДокументПоступление.РасшифровкаПлатежа.Добавить();
			НоваяСтрока.Услуга = ВыборкаДетали.Услуга;
			НоваяСтрока.Сумма = ВыборкаДетали.Сумма;
			НоваяСтрока.ПризнакАванса = ВыборкаДетали.ПризнакАванса;
			НоваяСтрока.МесяцНачисления = ?(ВыборкаДетали.ПризнакАванса,Дата('00010101'),ВыборкаДетали.МесяцНачисления);
		КонецЦикла;
		ДокументПоступление.Записать(РежимЗаписиДокумента.Проведение);
				
	КонецЦикла;
	ДокументПоступлениеСсылка = ДокументПоступление.Ссылка;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	
	Если Объект.РасшифровкаПлатежа.Количество() = 0  Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Необходимо сперва заполнить расшифровку платежа. Для этого нажмите ""Заполнить"" для автоматического заполнения или ""Подобрать"" ';
		|uk = 'Необхідно спершу заповнити розшифровку платежу. Для цього натисніть ""Заповнити"" для автоматичного заповнення або ""Підібрати""'");
		Сообщение.Поле = "РасшифровкаПлатежа";
		Сообщение.Сообщить(); 
		Возврат;
	КонецЕсли;	
	
	Отказ = ПроверитьКассыПоОрганизациям();
	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
	
	СоздатьДокументыНаСервере();
	Оповестить("ОбновлениеСписка",ДокументПоступлениеСсылка , ЭтаФорма);
	Закрыть();
КонецПроцедуры

&НаСервере
Функция ПроверитьКассыПоОрганизациям()
	
	Запрос = Новый Запрос;
	ЗАпрос.Текст =  "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                |	Кассы.Ссылка,
	                |	Кассы.Организация
	                |ПОМЕСТИТЬ ВТ_Касса
	                |ИЗ
	                |	Справочник.Кассы КАК Кассы
	                |ГДЕ
	                |	Кассы.Ответственный = &Ответственный
	                |	И Кассы.ПометкаУдаления = ЛОЖЬ
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	Организации.Ссылка КАК Организация,
	                |	ЕСТЬNULL(ВТ_Касса.Ссылка, """") КАК Касса
	                |ИЗ
	                |	Справочник.Организации КАК Организации
	                |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Касса КАК ВТ_Касса
	                |		ПО Организации.Ссылка = ВТ_Касса.Организация
	                |ГДЕ
	                |	Организации.Ссылка В(&Организации)";
	 Запрос.УстановитьПараметр("Организации",Организации);
	 Запрос.УстановитьПараметр("Ответственный",Объект.Ответсвенный);
	 Результат = ЗАпрос.выполнить();
	 
	 Если Результат.Пустой() Тогда
		 Сообщение = Новый СообщениеПользователю;
		 Сообщение.Текст = Нстр("ru = 'Для данного пользователя не создано ни одной кассы'; uk = 'Для цього користувача не створено жодної каси'");
		 Сообщение.Сообщить(); 
		 Возврат ИСТИНА;
	 КонецЕсли;
	 
	 Выборка = Результат.Выбрать();
	 Отказ = ЛОЖЬ;
	 Пока Выборка.Следующий() Цикл
		 Если Выборка.Касса = "" Тогда
			 Сообщение = Новый СообщениеПользователю;
			 Сообщение.Текст = СтрШаблон(Нстр("ru = 'Для организации %1 не создано кассу для данного пользователя'; uk = 'Для організації %1 не створено касу для цього користувача'")
			 							,Выборка.Организация);
			 Сообщение.Сообщить();
			 Отказ = Истина
		 КонецЕсли;
	 КонецЦикла;
	 
	 Возврат Отказ;
КонецФункции

&НаКлиенте
Процедура Подобрать(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.ЛицевойСчет) Тогда
		Режим = РежимДиалогаВопрос.ОК;
		Вопрос(НСтр("ru='Укажите вначале лицевой счет!';uk='Укажіть спочатку особовий рахунок!'"), Режим, 0);
		Возврат;
	КонецЕсли;
	
	АдресРасшифровкаПлатежаВХранилище = ПоместитьРасшифровкаПлатежаВХранилище();
	
	ПараметрыПодбора = Новый Структура(
		"АдресРасшифровкаПлатежаВХранилище,
		|Дата,
		|ЛицевойСчет,
		|ВалютаДенежныхСредств,
		|СуммаДокумента",
		АдресРасшифровкаПлатежаВХранилище,
		Объект.Дата,
		Объект.ЛицевойСчет,
		ВалютаДенежныхСредств,
		Объект.СуммаДокумента
	);
		
	Результат = ОткрытьФормуМодально("ОбщаяФорма.ФормаПодбораДолговПоЛицевымСчетамИОрганизциям", ПараметрыПодбора,ЭтаФорма);
	Если Результат = КодВозвратаДиалога.OK Тогда
		
		ПолучитьРасшифровкаПлатежаИзХранилища(АдресРасшифровкаПлатежаВХранилище);
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПолучитьРасшифровкаПлатежаИзХранилища(АдресРасшифровкаПлатежаВХранилище)
	
		
	ТаблицаРасшифровкаПлатежа = ПолучитьИзВременногоХранилища(АдресРасшифровкаПлатежаВХранилище);
	Объект.РасшифровкаПлатежа.Очистить();
	Для каждого СтрокаРасшифровкаПлатежа Из ТаблицаРасшифровкаПлатежа Цикл
		Строка = Объект.РасшифровкаПлатежа.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, СтрокаРасшифровкаПлатежа);
	КонецЦикла;
	
	Если Объект.СуммаДокумента = 0 Тогда
	
		Объект.СуммаДокумента = Объект.РасшифровкаПлатежа.Итог("Сумма");	
	
	КонецЕсли; 
	
	ТабОрганизации = Объект.РасшифровкаПлатежа.Выгрузить(,"Организация");
	ТабОрганизации.Свернуть("Организация");
	Для каждого Строка из  ТабОрганизации Цикл
		НоваяСтрока = Организации.Добавить(Строка.Организация);
	КонецЦикла;
	
КонецПроцедуры // ПолучитьРасшифровкаПлатежаИзХранилища()

&НаСервере
Функция ПоместитьРасшифровкаПлатежаВХранилище() 
	
	Возврат ПоместитьВоВременноеХранилище(
		Объект.РасшифровкаПлатежа.Выгрузить(),
		УникальныйИдентификатор
	);
	
КонецФункции // ПоместитьРасшифровкаПлатежаВХранилище()
